ws-asahi/UkiUkiCore/megaavr/variants/WazamonoTsurugi/pins_arduino.h
/* pins_arduino.h - Variant definition for the Wazamono Tsurugi (AVR64DU32)
 * ---------------------------------------------------------------------------
 * Part of WazamonoCore (a product-specific fork of SpenceKonde/DxCore).
 * DxCore is (C) Spence Konde 2021-2022, open source (LGPL 2.1, see LICENSE.md),
 * based on existing Arduino cores. This variant (C) Workshop Asahi 2026.
 *
 * Board   : Wazamono Tsurugi (Arduino Uno R3 form factor, AVR64DU32, USB-C)
 * MCU     : AVR64DU32  (32-pin TQFP/VQFN)
 * Clock   : internal OSCHF, 24 MHz fixed (no crystal on the board; boards.txt
 *           pins build.clocksource=0, no IDE clock menu). USB CLK_USB (48 MHz)
 *           is produced by OSCHF + PLL48M and auto-tuned to the USB SOF.
 *           PA0/PA1 (the XTALHF pads) are repurposed as the USB-CDC TX/RX
 *           activity LEDs (active-LOW, 3.3 V rail).
 *
 *  ===== Pin numbering: Arduino Uno R3 compatible (NONCANONICAL) =====
 *   D#   MCU   Uno R3 role / notes                          A#,  AIN
 *   D0   PA5   RX  (Serial0 / USART0 RX, ALT1)              A6,  AIN25
 *   D1   PA4   TX  (Serial0 / USART0 TX, ALT1)              A7,  AIN24
 *   D2   PA7   (USART0 XDIR | AC0 OUT | EVOUTA | CLKOUT)    A8,  AIN27
 *   D3   PA6   ~PWM(TCB1 via CCL LUT0) | USART0 XCK         A9,  AIN26
 *   D4   PC3   ~PWM(TCB1 via CCL LUT1) (VDD-driven, confirmed) A10, AIN31
 *   D5   PD0   ~PWM(TCA0 WO0) | CCL                         A11, AIN0
 *   D6   PD1   ~PWM(TCA0 WO1) | CCL                         A12, AIN1
 *   D7   PF4   (general I/O; no PWM - TCB0 is millis)          A13, AIN20
 *   D8   PF5   (general I/O; see D3 PWM note below)         A14, AIN21
 *   D9   PD2   ~PWM(TCA0 WO2) | CCL | AC0 AINP0 | EVOUTD    A15, AIN2
 *   D10  PD3   ~PWM(TCA0 WO3) | CCL | AC0 AINN0 | (SS)      A16, AIN3
 *   D11  PD4   ~PWM(TCA0 WO4) | SPI MOSI                    A17, AIN4
 *   D12  PD5   ~PWM(TCA0 WO5) | SPI MISO                    A18, AIN5
 *   D13  PD6   SPI SCK | LED_BUILTIN (op-amp buffered LED)  A19, AIN6
 *   D14  PF0   A0 | CCL                                     A0,  AIN16
 *   D15  PF1   A1 | CCL                                     A1,  AIN17
 *   D16  PF2   A2 | CCL | EVOUTF                            A2,  AIN18
 *   D17  PF3   A3 | CCL                                     A3,  AIN19
 *   D18  PA2   A4 | SDA (I2C)                               A4,  AIN22
 *   D19  PA3   A5 | SCL (I2C)                               A5,  AIN23
 *   --- appended pins (beyond the Uno R3 header numbering) ---
 *   D20  PD7   AREF | GPIO | SPI0 SS(ALT4) | Serial2 RX      A20, AIN7
 *        (usable as plain GPIO whenever no external reference is applied
 *         to the AREF header pin - a modern-AVR capability the Uno R3 lacks)
 *        PA0   TX activity LED (active-LOW)         index 21  (PIN_LED_TX)
 *        PA1   RX activity LED (active-LOW)         index 22  (PIN_LED_RX)
 *        PF6   RESET                                index 23
 *        PF7   UPDI                                 index 24  (== PIN_PF7, highest)
 *
 *  ===== Peripheral routing (set by this variant + boards.txt) =====
 *   TCA0  -> PORTD (WO0..WO5 = PD0,PD1,PD2,PD3,PD4,PD5 = D6,D5,D9,D10,D11,D12)
 *   TCB1  -> D3 PWM *through CCL LUT0*: D3 is PA6 = LUT0-OUT (alternate
 *           position). TCB1 runs in 8-bit PWM mode and its internal WO signal
 *           feeds LUT0 (INSEL1 = TCB, DS40002548A 30.2.2.1); the LUT passes it
 *           to the pin. analogWrite(D3, x) does all of this transparently
 *           (core wazamono_lutpwm.c). TCB1's own WO pin position is parked on
 *           ALT1/PF5 (TCB1_PINS) and its pin override stays off by default.
 *   millis-> TCB0 : boards.txt passes -DMILLIS_USE_TIMERB0, so TCB1 is free for D3.
 *   tone()-> TCB1 : Tone.cpp auto-selects TCB1 when millis is on TCB0. tone() and
 *           D3 PWM share TCB1, so calling tone() suspends D3 PWM only; D11 PWM
 *           (TCA0) and millis (TCB0) keep running (cf. Uno R3 Timer2 = D3+D11).
 *           Likewise, taking LUT0 over (direct CCL register use) suspends D3 PWM:
 *           analogWrite(D3) then falls back to plain digital output.
 *   SPI0  -> ALT4 (PD4 MOSI / PD5 MISO / PD6 SCK = D11/D12/D13). Board is SPI host;
 *           default CS exposed as PIN_SPI_SS = PD3 (D10, Uno convention). The ALT4
 *           hardware SS is PD7 (= AREF here); run SPI host with Client Select
 *           Disable (SPI0.CTRLB.SSD = 1) so the AREF level cannot flip host ->
 *           client mode.
 *   TWI0  -> default (PA2 SDA / PA3 SCL) = D18/D19 = A4/A5 (Uno I2C convention).
 *   USART0-> "Serial1", ALT1 (PA4 TX / PA5 RX) = D1/D0. The Uno R3 D0/D1 UART,
 *           named Serial1 to match the Uno R4 convention (WAZAMONO_SERIAL1_IS_
 *           USART0; the object is Serial0, Serial1 is its alias - see UART0.cpp).
 *   USART1-> "Serial2", ALT2 fixed (PD6 TX = D13 / PD7 RX = D20, the AREF
 *           pin) - the only DU USART1 position that exists here. Shares its
 *           pins with SPI0 SCK and the AREF function (user-level conflict).
 *   LED   -> on-board LED follows D13 (PD6, SPI SCK) through a unity-gain op-amp
 *           buffer on the board - the same arrangement as the Arduino Uno R3 - so
 *           the LED never loads the SCK line. No firmware is involved.
 *   AREF  -> PD7 (VREFA) is wired to the AREF header pin for an external analog
 *           reference; it has no digital pin number.
 *   Serial-> native USB CDC (USBSerial), Leonardo/Micro convention.
 *
 *   NOTE on names: "Serial" is the native USB CDC (serial monitor), so day-to-day
 *   Serial.print() behaves exactly like a classic Uno. The D0/D1 hardware UART is
 *   "Serial1", matching the Arduino Uno R4. (Serial0 also works - same port.)
 */

#ifndef Pins_Arduino_h
#define Pins_Arduino_h
#include <avr/pgmspace.h>
#include "timers.h"

/* Informational pinout tags. DU_32PIN_PINOUT keeps DU-32 feature assumptions in
 * the core; WAZAMONO_TSURUGI_PINOUT identifies this board. NONCANONICAL_PIN_NUMBERS
 * tells the core to derive (port,bit) from the tables below instead of assuming
 * pin number == port order (our numbering does not follow port order). */
#define DU_32PIN_PINOUT
#define WAZAMONO_TSURUGI_PINOUT
#define WAZAMONO_BOARD_TSURUGI 1  /* Board identification macro (matches bootloader convention) */
#define NONCANONICAL_PIN_NUMBERS

/* ---- Digital pin number for each MCU pin (Uno R3 layout, D0..D19 contiguous) ---- */
#define PIN_PA5 (0)   // D0  RX  (USART0 RX, ALT1)
#define PIN_PA4 (1)   // D1  TX  (USART0 TX, ALT1)
#define PIN_PA7 (2)   // D2  (USART0 XDIR / AC0 OUT / EVOUTA / CLKOUT)
#define PIN_PA6 (3)   // D3  ~PWM(TCB1 via CCL LUT0) / USART0 XCK
#define PIN_PC3 (4)   // D4  ~PWM(TCB1 via CCL LUT1); VDD-driven output (confirmed by measurement)
#define PIN_PD0 (5)   // D5  TCA0 WO0
#define PIN_PD1 (6)   // D6  TCA0 WO1
#define PIN_PF4 (7)   // D7  general I/O (no PWM: TCB0 = millis)
#define PIN_PF5 (8)   // D8  general I/O (TCB1 WO parking position - see D3 PWM note)
#define PIN_PD2 (9)   // D9  TCA0 WO2
#define PIN_PD3 (10)  // D10 TCA0 WO3 / SS (Uno convention, SSD=1)
#define PIN_PD4 (11)  // D11 TCA0 WO4 / SPI MOSI
#define PIN_PD5 (12)  // D12 TCA0 WO5 / SPI MISO
#define PIN_PD6 (13)  // D13 SPI SCK / LED_BUILTIN (op-amp buffered on the board)
#define PIN_PF0 (14)  // D14 A0
#define PIN_PF1 (15)  // D15 A1
#define PIN_PF2 (16)  // D16 A2
#define PIN_PF3 (17)  // D17 A3
#define PIN_PA2 (18)  // D18 A4 / SDA
#define PIN_PA3 (19)  // D19 A5 / SCL
#define PIN_PD7 (20)  // D20/A20 = AREF (VREFA) | GPIO | SPI0 SS(ALT4) | Serial2 RX
#define PIN_PA0 (21)  // TX activity LED (active-LOW; USB-CDC traffic, variant-driven)
#define PIN_PA1 (22)  // RX activity LED (active-LOW; USB-CDC traffic, variant-driven)
#define PIN_PF6 (23)  // RESET
#define PIN_PF7 (24)  // UPDI  (highest index -> sets NUM_DIGITAL_PINS = 25)

/* ---- Counts ---- */
#define PINS_COUNT                     (25)  // length of the pin tables (incl. reserved)
#define NUM_ANALOG_INPUTS              (31)  // highest ADC channel in use is AIN31 (PC3)
// NUM_DIGITAL_PINS / NUM_TOTAL_PINS  -> auto = PIN_PF7 + 1 = 25
// NUM_INTERNALLY_USED_PINS           -> auto = 0 (no crystal; PA0/PA1 = TX/RX LEDs, still writable GPIO)

#if !defined(LED_BUILTIN)
  #define LED_BUILTIN                  (PIN_PD6)   // D13, on-board LED (Uno convention)
#endif
/* USB-CDC activity LEDs (Pro Micro convention, both active-LOW, 3.3 V rail).
 * Driven from the CDC hooks in wazamono_tsurugi_init.cpp; sketches may also
 * digitalWrite() them - they just fight the ~100 ms activity pulses. */
#define PIN_LED_TX                     (PIN_PA0)
#define PIN_LED_RX                     (PIN_PA1)
#define LED_BUILTIN_TX                 PIN_LED_TX
#define LED_BUILTIN_RX                 PIN_LED_RX

/* ---- Event output pins: FIXED by the board's pin-configuration table ----
 * One pin per event output, no alternatives. Libraries (CustomLogic, and the
 * Event library in its Wazamono form) route event outputs to these pins only.
 *   EVOUTA -> PA7 = D8   (PORTMUX ALT1; PA2/D18 stays I2C SDA)
 *   EVOUTD -> PD2 = D9   (PORTMUX default; the hardware offers only PD2 or
 *                         PD7, and PD7 is the AREF pin on this board)
 *   EVOUTF -> PF2 = A2   (PORTMUX default) */
#define WAZAMONO_EVOUTA_PIN            (PIN_PA7)
#define WAZAMONO_EVOUTA_ALT            (1)
#define WAZAMONO_EVOUTD_PIN            (PIN_PD2)
#define WAZAMONO_EVOUTD_ALT            (0)
#define WAZAMONO_EVOUTF_PIN            (PIN_PF2)
#define WAZAMONO_EVOUTF_ALT            (0)

#ifdef CORE_ATTACH_OLD
  #define EXTERNAL_NUM_INTERRUPTS      (48)
#endif

/* ---- Explicit maps (NONCANONICAL numbering: arithmetic shortcuts cannot be used) ---- */
#define digitalPinToAnalogInput(p)  ( \
    (p) == PIN_PD0 ?  0 : (p) == PIN_PD1 ?  1 : (p) == PIN_PD2 ?  2 : (p) == PIN_PD3 ?  3 : \
    (p) == PIN_PD4 ?  4 : (p) == PIN_PD5 ?  5 : (p) == PIN_PD6 ?  6 : (p) == PIN_PD7 ?  7 : \
    (p) == PIN_PF0 ? 16 : (p) == PIN_PF1 ? 17 : (p) == PIN_PF2 ? 18 : (p) == PIN_PF3 ? 19 : \
    (p) == PIN_PF4 ? 20 : (p) == PIN_PF5 ? 21 : \
    (p) == PIN_PA2 ? 22 : (p) == PIN_PA3 ? 23 : (p) == PIN_PA4 ? 24 : (p) == PIN_PA5 ? 25 : \
    (p) == PIN_PA6 ? 26 : (p) == PIN_PA7 ? 27 : (p) == PIN_PC3 ? 31 : NOT_A_PIN )

#define analogChannelToDigitalPin(p)  ( \
    (p) ==  0 ? PIN_PD0 : (p) ==  1 ? PIN_PD1 : (p) ==  2 ? PIN_PD2 : (p) ==  3 ? PIN_PD3 : \
    (p) ==  4 ? PIN_PD4 : (p) ==  5 ? PIN_PD5 : (p) ==  6 ? PIN_PD6 : (p) ==  7 ? PIN_PD7 : \
    (p) == 16 ? PIN_PF0 : (p) == 17 ? PIN_PF1 : (p) == 18 ? PIN_PF2 : (p) == 19 ? PIN_PF3 : \
    (p) == 20 ? PIN_PF4 : (p) == 21 ? PIN_PF5 : \
    (p) == 22 ? PIN_PA2 : (p) == 23 ? PIN_PA3 : (p) == 24 ? PIN_PA4 : (p) == 25 ? PIN_PA5 : \
    (p) == 26 ? PIN_PA6 : (p) == 27 ? PIN_PA7 : (p) == 31 ? PIN_PC3 : NOT_A_PIN )

